<?php
//แสดงข้อมูลแบบเรียงลำดับ 

//อาเรย์แบบเดี่ยว

    $number = [10,1,15,20,2,25,30,3,35,100];
    $city = ["กรุงเทพ","ชลบุรี","ระยอง","เชียงใหม่","นครพนม"];

//เรียกใช้งาน เรียงลำดับอาเรย์เดี่ยว
    print_r($number); //แสดงข้อมูลเก่า
    print("<br>");
    sort($number);//ทำการเรียงลำดับ
    print_r($number); //แสดงข้อมูลใหม่
    print("<br>");
    print("<hr>");   


//อาเรย์แบบคู่

    $eng = ["A"=>15,"B"=>10,"C"=>5,"D"=>20];
    $country = ["TH"=>"ไทย","JP"=>"ญี่ปุ่น","US"=>"อเมริกา"];

//เรียกใช้งาน เรียงลำดับอาเรย์คู่
    print_r($eng); //แสดงข้อมูลเก่า
    print("<br>");
    asort($eng);//ทำการเรียงลำดับ asort ตามตัวเลข
    print_r($eng); //แสดงข้อมูลใหม่
    print("<br>");
    print("<hr>");   


?>