<?php
//function รับค่าและส่งค่า
//รับเงินเดือนและจำนวณเดือนทำงานมาคำนวณ
//คำนวณรายได้ประจำปี

    function getTotal ($salary , $count){
        //คำนวณเงินเดือน * จำนวณเดือนที่ทำงาน
        return $salary * $count;
    }

    $amount = 20000; //รับค่าเงินเดือน
    $month = 12; //รับค่าจำนวณเดือนที่ทำงาน
    print("เงินเดือน = ".$amount." บาท"); //แสดงจำนวณเงิน
    print("<br>");
    print("ระยะเวลา = ".$month." เดือน"); //แสดงจำนวณเดือนทำงาน
    print("<br>");
    $total = getTotal($amount , $month); //ดึงฟังก์ชั่นมาใช้
    print("รายได้ = ".$total." บาท"); //แสดงผลรวมเงินเดือนที่ไ้
    print("<br>");
    print("<hr>");

    
?>